lib/tasks/seeds.rake

INSERT INTO "countries" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Afghanistan"], ["created_at", "2021-05-04 20:34:43.981118"], ["updated_at", "2021-05-04 20:34:43.981118"]]
SELECT "countries".* FROM "countries" WHERE "countries"."name" = $1 LIMIT $2  [["name", "Afghanistan"], ["LIMIT", 1]]
---
    task countries: :environment do
      message "Countries"
      open_yaml("countries").each do |country|
        Country.find_or_create_by(name:country)

INSERT INTO "ce_categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Chemical substances (REACH)"], ["created_at", "2021-05-04 20:34:48.357055"], ["updated_at", "2021-05-04 20:34:48.357055"]]
SELECT "ce_categories".* FROM "ce_categories" WHERE "ce_categories"."name" = $1 LIMIT $2  [["name", "Chemical substances (REACH)"], ["LIMIT", 1]]
---
    task ce_categories: :environment do
      message "CE Categories"
      open_yaml("ce_categories").each do |name|
        CeCategory.find_or_create_by(name:name)

INSERT INTO "product_categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Apparel & Accessories"], ["created_at", "2021-05-04 20:34:46.142541"], ["updated_at", "2021-05-04 20:34:46.142541"]]
SELECT "product_categories".* FROM "product_categories" WHERE "product_categories"."name" = $1 LIMIT $2  [["name", "Apparel & Accessories"], ["LIMIT", 1]]
---
    task product_categories: :environment do
      message "Product Categories"
      open_yaml("product_categories").each do |name|
        ProductCategory.find_or_create_by(name:name)

INSERT INTO "industries" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Apparel & Accessories"], ["created_at", "2021-05-04 20:34:46.453795"], ["updated_at", "2021-05-04 20:34:46.453795"]]
SELECT "industries".* FROM "industries" WHERE "industries"."name" = $1 LIMIT $2  [["name", "Apparel & Accessories"], ["LIMIT", 1]]
---
    task industries: :environment do
      message "Industries"
      open_yaml("industries").each do |name|
        Industry.find_or_create_by(name:name)