app/views/devise/registrations/new.html.erb

            <div class="form-rows">
              <%= ff.input :industry_id,as: :select, input_html:{class:"custom-select mb-3"}, collection:Industry.pluck(:name,:id),required:true %>
---
SELECT "industries"."name", "industries"."id" FROM "industries"