app/controllers/admin/enquiries_controller.rb

SELECT "enquiries".* FROM "enquiries" LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    @q=Enquiry.ransack(params[:q])
    @enquiries = @q.result.page(params[:page]).per(10)