app/controllers/admin/products_controller.rb

SELECT "products".* FROM "products" LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    @q = current_user.admin?? Product.ransack(params[:q]) : current_user.company.products.ransack(params[:q])
    @products = @q.result.includes(:company,:product_category).page(params[:page]).per(10)

INSERT INTO "products" ("name", "company_id", "model_number", "description", "created_at", "updated_at", "notes", "image", "product_category_id", "share_code", "is_imported", "is_approved", "searchable") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def create
    if params[:copy_supplier_to_manufacturer].present?
      params[:product][:manufacturer_attributes] = params[:product][:supplier_attributes]
    end
    @product = current_user.admin?? Product.new(product_params) : current_user.company.products.new(product_params)
    if !@product.valid?
      build_product_associations
      flash[:alert] = I18n.t('flash.actions.create.alert', resource_name: @product.class)