app/controllers/admin/users_controller.rb

SELECT "companies".* FROM "companies" WHERE "companies"."id" IN ($1, $2)  [["id", 2], ["id", 1]]
SELECT "users".* FROM "users" LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index

    @q = current_user.admin? ? User.ransack(params[:q]) : current_user.company.users.ransack(params[:q])
    @users = @q.result.includes(:company).page(params[:page]).per(10)