app/views/admin/products/_all_supplier_fields.html.erb

          <div class="form-rows">
            <%= address.input :country_id, as: :select,error:"Required field", required: true, collection: Country.pluck(:name,:id) %>
---
SELECT "countries"."name", "countries"."id" FROM "countries"