app/views/admin/products/_form.html.erb

          <div class="form-rows">
            <%=f.association :company,collection: Company.unarchived.pluck(:name,:id),error:"Required field",include_blank:true,prompt:"Select Company",input_html:{class:"custom-select mb-3"} if can? :change_company, @product %>
---
SELECT "companies"."name", "companies"."id" FROM "companies" WHERE "companies"."archived" = $1  [["archived", false]]