app/views/admin/products/show.html.erb

SELECT 1 AS one FROM "documents" WHERE "documents"."product_id" = $1 LIMIT $2  [["product_id", 1], ["LIMIT", 1]]
---
        <div class="product-docs">
          <%if @product.documents.empty? %>