app/controllers/products_controller.rb

  def search
    params[:q].present? && params[:q]['company_name_matches'].present? ? params[:q]['company_name_matches']= params[:q]['company_name_matches'].split(".")[0] : params[:q]
    @q=Product.published.imported.admin_approved.search(params[:q])
    if params[:q].present?
      @products=@q.result.includes(:product_category,:company).order("companies.name ASC,products.name ASC")
---
SELECT "product_categories".* FROM "product_categories" WHERE (parent_id is null) ORDER BY name ASC