app/models/product_category.rb

SELECT "product_categories".* FROM "product_categories" WHERE (parent_id is null) ORDER BY name ASC
---
  def self.formatted_categories
    ProductCategory.parent_categories.order("name ASC").map{|c| [c.name.titleize.gsub(/(T Vs & Monitors)/,"TV, Monitors & Projectors").gsub(/(Telecom)/,"Telecoms"), c.id] }

SELECT "product_categories".* FROM "product_categories" WHERE (parent_id is null) ORDER BY name ASC
---
  def self.filtered_categories
    ProductCategory.parent_categories.order("name ASC").map{|c| [c.name.titleize, c.id]  }