app/views/admin/shared/_address.html.erb

SELECT "countries"."name", "countries"."id" FROM "countries"
---
        <div class="form-rows">
          <%= address.input :country_id, as: :select, required:true, collection: Country.pluck(:name,:id),input_html:{class:"custom-select"} %>